<template>
    <div class="customer">
        <div class='currentNav'>
            当前位置: <router-link to='/customer/contract'>客户合同</router-link> >
            合同详情 -- <small>{{cname}}</small>
        </div>
        <h1>合同详情.....</h1>
        <div class="contract-details">
            <div class="con-title">

                基本信息

            </div>
            <ul>
                <li>前期服务费：{{cdetails.preFee}}元</li>
                <li>收费比例：{{cdetails.payRatio}}</li>
                <li>付款方式：{{cdetails.payType}}</li>
                <li>最低收费：{{cdetails.minCharge}}元</li>
                <li>合同开始时间：{{cdetails.strartTime}}</li>
                <li>合同结束时间：{{cdetails.endTime}}</li>
                <li>特殊说明：{{cdetails.instruction || '--'}}</li>
                <li>保证期：{{cdetails.ensurePeriod}}</li>
                <li>回款日期：</li>
                <li>目前状态：</li>
                <li>回款计划：</li>
            </ul>
        </div>
        <div class="con-detail">
            <div class="con-title">

                合同文本

            </div>
            <div class="information">
                <h4>一、基本信息</h4>
                <p>
                    甲 方：（以下简称甲方）<br><br> 乙 方：浙江千里马人力资源股份有限公司 （以下简称乙方）<br><br> 甲乙双方本着平等自愿、有偿服务的原则，就甲方委托乙方猎头服务等事宜，经沟通协商，达成如下协议，以资共同恪守

                    <br><br>
                </p>
                <h4>二、服务内容及费</h4>
                <p>
                    1、委托岗位：详见附件《猎头订单》<br> 2、乙方按被录用者的税前年薪（包括基本工资、津贴、奖金和提成）的30%收取服务费。

                    <br> 3、合同签定后，在乙方开展搜寻工作前，甲方须向乙方支付前期服务费以支持乙方的前期工作，前期服务费收费标准为:每个岗位¥10000元，前期服务费可转抵服务费。

                    <br> 4、甲方应于正式聘用候选人到岗后两周内支付所有的服务费，如甲方逾期付款，则每天按应付金额的千分之一向乙方支付滞纳金。

                    <br> 5、服务费用须汇入乙方指定帐号：

                    <br> 户 名：浙江千里马人力资源股份有限公司<br> 开户行：杭州银行学院路支行

                    <br> 银行帐号：74218100011811

                    <br> 6、每个岗位乙方至少按最低¥30000元的标准收费，超过的按实际比例收取，每猎取一位候选人上岗，即收取该笔服务费。

                    <br> 7、甲方雇佣乙方推荐的候选人，除年薪外，另给予候选人股份或期权，甲方须按照税前年薪2倍计算服务费。

                    <br> 8、因服务费未汇入乙方指定账户视为甲方未按时付款，由此发生的损失和违约责任由甲方承担。

                    <br>
                </p>
                <h4>三、权利和义务</h4>
                <h5>甲方权利和义务</h5>
                <p>
                    1、甲方必须向乙方提供真实详细的企业资料和《猎头订单》。<br> 2、甲方对乙方推荐的候选人进行面试后，必须在5个工作日内给出是否录用该候选人的意见。若甲方发现乙方所推荐之候选人在乙方将其资料送达甲方之前已从其它渠道获得，则甲方应在收到乙方送达简历后的48小时内书面通知乙方；否则，该候选人应被认定为由乙方推荐。

                    <br> 3、甲方不得利用候选人获取候选人违反其与原工作单位签订的保密协议规定的保密义务，因甲方利用候选人获取原单位保密信息而引起的任何后果由甲方独自承担，与乙方无关。

                    <br> 1、甲方必须向乙方提供真实详细的企业资料和《猎头订单》。

                    <br> 2、甲方对乙方推荐的候选人进行面试后，必须在5个工作日内给出是否录用该候选人的意见。若甲方发现乙方所推荐之候选人在乙方将其资料送达甲方之前已从其它渠道获得，则甲方应在收到乙方送达简历后的48小时内书面通知乙方；否则，该候选人应被认定为由乙方推荐。

                    <br> 3、甲方不得利用候选人获取候选人违反其与原工作单位签订的保密协议规定的保密义务，因甲方利用候选人获取原单位保密信息而引起的任何后果由甲方独自承担，与乙方无关。

                    <br> 4、甲方作为雇主应当对自己雇员的最终选择、录用、持续工作监管承担全部责任，对于推荐候选人所引起（或相关）的对甲方造成的损失、损坏或费用等将由甲方自行承担，乙方不承担任何相关责任。

                    <br> 5、甲方承担候选人面试所产生的所有差旅费用，定向猎取或需要乙方随同甲方外出洽谈、面试，甲方须为乙方支付定向所在地猎聘往返差旅费。

                    <br> 6、对于乙方所推荐的候选人的相关资料，甲方不能作为其他用途并负有保密的义务，否则赔偿相应损失；甲方若将乙方推荐的候选人转给其它任何第三方并产生聘用的，视为乙方已完成服务工作并支付相关服务费用。

                    <br> 7、甲方确定候选人录用后3日内，须向乙方以书面的形式提供《录用确认函》或《录用通知函》。

                    <br><br>
                </p>
                <h5>乙方权利和义务</h5>
                <p>
                    1、乙方承诺不主动猎取甲方在职人员，并保守甲方公司的机密。<br> 2、乙方按照甲方《猎头订单》进行候选人搜寻、面试，并对甲方公司的招聘信息严格保密。

                    <br> 3、乙方为甲方提供详尽的候选人推荐报告，提供专业的面试建议和用人建议。

                    <br> 4、乙方协助甲方与候选人进行薪酬谈判、到岗日期等促进招聘工作，协助甲方与候选人签定劳动合同，并进行后期候选人的跟踪服务，如果被录取者的薪酬福利等未能按甲方与候选人事先约定之标准实施，而导致被录取者离职的，乙方不退还该岗位的所有服务费，并由甲方承担由此而来的一切责任。

                    <br> 5、自双方确定《猎头订单》且前期服务费到账之日起十个工作日内，乙方未能向甲方提供候选候选人资料，或提供候选人不符合《猎头订单》要求导致三十个工作日内无人选面试的，甲方有权终止本合约，乙方退还本岗位已收取的前期服务费。

                    <br> 6、乙方推荐的候选人，甲方面试后因故不能全职聘用该候选人，而委托该候选人担任兼职或其它短期服务，同样视为乙方已完成服务工作，甲方须按照第二条第6款支付相应的服务费用。

                    <br> 7、本协议签订后，甲方鼓动、引诱、劝说乙方推荐的候选人绕开乙方私下录用或变更实际薪酬标准的，视为乙方已完成服务工作，甲方须按照第二条第2款支付相应的服务费用。

                    <br>
                </p>
                <h4>四、保证期及其他保障条款</h4>
                <p>
                    1、乙方推荐的候选人保证期为三个自然月（自候选人报到之日起计算），甲方只有遵守第二条才享有保证期服务。<br> 2、候选人在保证期内离职或被甲方辞退，甲方应在一周内通知乙方，乙方需在两个月内免费再为甲方猎聘同岗位的一个合适候选人，如果双方终止合约，乙方须向甲方退还该岗位已服务费用的40%，如后期 推荐成功候选人年薪发生变化，甲乙双方按实际年薪核定服务费，退补差额，也可将该服务费用于在合 同有效期内发生的其它岗位的委托招聘。<br> 3、本合约签订后，如果乙方提供人选信息而甲方迟迟不配合乙方候选人面试，或因甲方自身公司架构调整、业务变化等任何原因而导致原委托职位的撤消，甲方提出终止寻访，则前期服务费不退。

                    <br> 4、所有与被推荐人员的联络均应通过乙方进行，如甲方未经乙方同意，私自与被推荐人员联络，则视为乙方已提供本合同约定相关猎头服务，甲方应向乙方支付本合同规定的相应款项。

                    <br> 5、无论本协议是否解除、终止或履行完毕，甲方在三年内（从乙方提供候选人个人材料之日起计）录用乙方曾推荐过的候选人的（包括任何职务）或将候选人推荐给其他单位并产生雇佣关系，均视为乙方推荐成功，甲方应于被录用人到位前通知乙方，并按本协议约定的收费标准向乙方支付服务费。

                    <br>
                </p>

                <h4> 五、其他</h4>
                <p>1、本合同中所述委托是指甲乙双方书面（包括但不限于合同、协议、信件、传真、电子邮件等）确认甲方需要乙方推荐、寻访的职位以及该职位所需的关键要求。在乙方提供推荐、寻访服务过程中，甲方任何对上述委托职位所需关键要求的变更将被视为新委托的产生。上述委托为本合同的附件，是本合同的一部分，与本合同具有同等法律效力。本合同所附任何附件，经双方签字确认后，均与主合同具有同等法律效力。<br> 2、对未尽事宜双方协商一致补充如下： 无<br> 3、本合同自双方签字盖章之日起生效。有效期为24个月，合同期内，双方以具体《猎头订单》作为工作开展依据。

                    <br> 4、本合同壹式贰份，双方各执壹份。未尽事宜，双方协商，协商不成，交乙方所在地人民法院提起诉讼。

                    <br> （以下无正文）
                </p>
                <ul>
                    <li>甲方：（盖章）</li>
                    <li>乙方：浙江千里马人力资源股份有限公司（盖章）</li>
                    <li>代表： </li>
                    <li>代表： </li>
                    <li>地址：</li>
                    <li>地址：杭州文一西路1324号利尔达科技园3号楼601</li>
                    <li>电话： </li>
                    <li>电话：0571-89301988</li>
                    <li>日期：</li>
                    <li>日期：</li>
                </ul>
            </div>
        </div>
    </div>
</template>

<script>
// @ is an alias to /src
import api from "@/api";
import ls from "store2";
export default {
    name: "home",
    data() {
        return {
            id: this.$route.query.id,
            cname: this.$route.query.cname,
            cdetails: {}
        }
    },
    components: {},
    methods: {
        contractDetails() {
            api
                .axs("post", "/contract/info", {id: this.id})
                .then(({
                    data
                }) => {
                    if (data.code === "SUCCESS") {
                        this.cdetails = data.data
                        this.$Loading.finish()
                        this.$store.state.spinShow = false
                    } else {
                        this.$Message.error(data.remark)
                    }
                })
        }
    },
    mounted() {
        this.contractDetails()
    }
};
</script>
<style lang='less' scoped>
.contract-details {
    width: 100%;
    padding: 0.75rem;
    border: 1px solid #ddd;
    .con-title {
        padding: 0 0.3rem;
        margin: 0.5rem 0;
        font-size: 16px;
        border-left: 3px solid #2d8cf0;
        color: #2d8cf0;
        font-weight: 700;
    }
    ul {
        width: 50%;
        overflow: auto;
        li {
            width: 50%;
            float: left;
            font-weight: 700;
            margin: 0.3rem 0;
            font-size: 0.85rem;
        }
    }
}
.con-detail {
    width: 100%;
    padding: 0.75rem;
    border: 1px solid #ddd;
    margin-top: 0.5rem;
    .con-title {
        padding: 0 0.3rem;
        margin: 0.75rem 0;
        font-size: 16px;
        border-left: 3px solid #2d8cf0;
        color: #2d8cf0;
        font-weight: 700;
    }
    .information {
        h4 {
            font-size: 15px;
            font-weight: 700;
            //   font-size: 0.85rem;
            margin: 0.75rem 0;
        }
        h5 {
            font-weight: 700;
            font-size: 0.85rem;
            margin: 0.75rem 0;
        }
        p {
            font-size: 14px;
            letter-spacing: 2px;
        }
        ul {
            width: 100%;
            overflow: auto;
            margin-top: 1.2rem;
            li {
                float: left;
                width: 50%;
                font-weight: 700;
                margin: 0.3rem 0;
                font-size: 0.85rem;
            }
        }
    }
}
</style>

